const App = () => {
  return (
    <>
      {/* error boundary არის კომპონენტი, რომელიც გამოიყენება რომელიმე კომპონენტში შექმნილი 
      შეცდომების გასაჩერებლად რომ არ გაიქრაშოს მთელი აპი. ის არის გამოსადეგი რადგან ხელს გვიწყობს რომ თავი ავირიდოთ ზედმეტი errorებისგან */}

      {/* getDerivedStateFromError() - მუშაობს შეცდომის დროს და გვაზლევს საშუალებას state შევცვალოთ */}

      {/* componentDidCatch() გამოიყენება შეცდომის გაუქმებისთვის და ,,დამუშავებისთვის,, */}

      {/* reset() აბრუნებს თავდაპირველ მდგომარეობაში */}
    </>
  )
}