const App = () => {
  return (
    <>
      {/* url - არის მოთხოვნა, რომელიც იგზავნება ჩვენს კომპონენტებში და ასრულებს ჩვენით მითითებულ პირობებს.
      ასევე ინფორმაციას აგზავნის რამდენიმე კომპონენტზე - სავალდებულოზეც და არასავალდებულოზეც */}
      {/* url შედგება 4 ნაწილისგან 
        1 - პროტოკოლი - სქემა, რომლიც საზღვრავს რომელი პროტოკოლი უნდა იყოს გამოყენებული რესურსზე წვდომისთვის
        2 - დომეინი - გამოიყენება აპლიკაციაში შესასვლელად
        3 - ბილიკი - მიბვუთითებთ რომელ გვერდზე შევიდეს
        4 - query - ?-ის შემდეგ პარამეტრებს ანიჭებს მნიშვნელობებს */}
    </>
  )
}

export default App;