#პირველი დავალება
num1 = int(input("შეიყვანე შენი დაბადების წელი: "))
print(num1)
#ეს წინადადება გადავაქციე ინტეჯერად, რადგან ის სტრინგის სახითაა გადმოცემული

#მეორე დავალება
name = input("შეიყვანე შენი სახელი: ")
print("hello "  +  name  +  "!" )

#მესამე დავალება
#კონკატენაცია არის რამდენიმე სტრინგის შეერთებას

#მეოთხე დავალება
#მონაცემთა ტიპებია - str(სტრინგი-string), int(ინტეჯერი-integer) და float

#მეხუთე დავალება
#რას აკეთებს type() ფუნქცია - მას გამოაქვს ტერმინალში, თუ რა ტიპის წინადადება გვაქვს მოცემული
#რას აკეთებს int() ფუნქცია - მას ტერმინალში რიცხვი ათწილადად გამოაქვს
#რას აკეთებს str() ფუნქცია - მას ვწერთ ბრჭყალებში და ტერმინალში გამოაქვს ჩვეულებრივი სიტყვა ან წინადადება
