# დავალება 1
# boolean არის მონაცემთა ტიპი, რომელსაც აქვს ორი შესაძლებლობა: True ან False
# დავალება 2
# binary code არის სისტემა, რომელიც შეიცავს მხოლოდ ორ რიცხვს: 0 და 1
# დავალება 3

# >-ის 10 მაგალითი
print(5 > 3)
print(10 > 3)
print(5 > 6)
print(4>2)
print(9>2)
print(6>3)
print(2>0)
print(10>8)
print(3>10)
print(6>9)

# <-ის 10 მაგალითი
print(2<2)
print(3<5)
print(4<3)
print(7<9)
print(4<3)
print(2<4)
print(9<2)
print(4<6)
print(7<8)
print(9<3)

# ==-ის 10 მაგალითი
print(10==3)
print(9==2)
print(10==2)
print(5==6)
print(3==6)
print(5==6)
print(1==1)
print(1==1)
print(5==22)
print(3==6)

# !=-ის 10 მაგალითი
print(9!=0)
print(9!=9)
print(3!=4)
print(4!=3)
print(8!=7)
print(1!=9)
print(7!=0)
print(3!=9)
print(7!=3)
print(6!=0)
print(9!=3)

# დავალება 4
# > (მეტი): შეამოწმებს, არის თუ არა პირველი რიცხვი დიდი მეორე რიცხვზე.
# < (ნაკლები): შეამოწმებს, არის თუ არა პირველი რიცხვი ნაკლები მეორე რიცხვზე.
# == (ტოლია): შეამოწმებს, არის თუ არა პირველი რიცხვი მეორე რიცხვთან ტოლი.
# != (არ არის ტოლი): შეამოწმებს, არის თუ არა პირველი რიცხვი განსხვავებული მეორე რიცხვისგან.

# დავალება 5
num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))
print(num1 > num2)
print(num1 < num2)
print(num1 == num2)
print(num1 != num2)


