from turtle import *
# დავალება 1
def two_numbers(num1, num2):
    return  num1 + num2

# დავალება 2
def reverse_string(string):
    return  string[::-1]

# დავალება 3
def maximum_num(number):
    num1 = number[0]
    for i in number[1:]:
        if i > num1:     
           num1 = i
    return  num1

# დავალება 4
# ფუნქცია არის კოდების ჯგუფი, რომელიც მუშაობს ერთხელ ან მეტჯერ
# def გამოიყენება ფუნქციის გასნზაღვრისთვის
# function name - ფუნქციის სახელი - ჩვენ ვნიჭებთ სახელს ფუნქციას
# function parameter - ფუნქციის პარამეტრი - ეს არის არგუმენტები, რომლებსაც ფუნქცია იღებს მისი გამოძეხების დროს
# indentation - ინდენტაცია - ეს არის კოდის დაშორება ერთი ტაბით მარჯვნივ გადავანა
# code block - კოდის ბლოკი - ეს არის კოდის ჯგუფი, სადაც კოდები ერთადაა თავმოყრილი
# function call - ფუნქციის გამოძახება - ამით ჩვენ ფუნქციას ვკარნახობთ, რომ რაიმის გაკეთებას ან გამმოტანას ვაპირებთ
# function argument - ფუნქციის არგუმენტი - ეს არგუმენტი გადაეცემა კონკრეტულ სახელს


# sololearn არ გვქონდა