// npm არის მაგ. საყრდენი რეაქთის და vite-ს და სხვ. ბიბლითეკის ადვილად ჩამოსატვირთად
// vite არის რექთის პროექტის შესაქმნელად უსწრაფესი ხელსაწყო 

// node_modules - აქ ინახება რეაქთის უმთავრესი ფაილები
// src - აქ ინახება ყველა ფაილი, სადაც კოდს ვწერთ
// app.jsx - აქ ვწერთ პროექტის მთავარ შინაარსს და ხშირად ვიძახებთ კომპონენტებს
// main.jsx - html-დან გადმოაქვს ერთგვარი ელემენტები, რომლებსაც შემდეგ გადააქცევს როგორ jsx ელემენტებად
// .gitignore - ეს აიგნორებს ჩვენს მითითებულ კოდს და ფაილს
// package.json - ეს არის პროექტის მონაცემთა ბარათი.
