#შემომაქვს სახელი, გვარი და ასაკი
Name = input("შეიყვანე შენი სახელი: ")
namE = input("შეიყვანე შენი გვარი: ")
naMe = input("შეიყვანე შენი ასაკი: ")

print("გამარჯობა" + Name + namE + naMe)

#შემომაქვს ორი რიცხვი და ვაკეთებ მასზე მათემატიკურ გამოთვლებს
num1=int(input("შეიყვანე პირველი რიცხვი: "))
num2=int(input("შეიყვანე მეორე რიცხვი: "))
print(num1 + num2)
print(num1 - num2)
print(num1 / num2)
print(num1 * num2)

#შემომაქვს იმეილი და პაროლი
name = input("შეიყვანე შენი ემაილი: ")
Name = input("შეიყვანე პაროლი: ")

print(name  +  Name)

#დავალებაში გამოვიყენე განხლილი მასალა...